openharmony/device_soc_beken/bk7235/liteos_m/bk_sdk_armino/middleware/soc/bk7235/soc/aud_struct.h
// Copyright (C) 2022 Beken Corporation
// 
// Licensed under the Apache License, Version 2.0 (the "License");           
// you may not use this file except in compliance with the License.            
// You may obtain a copy of the License at                                     
//                                                                             
//     http://www.apache.org/licenses/LICENSE-2.0                              
//                                                                             
// Unless required by applicable law or agreed to in writing, software         
// distributed under the License is distributed on an "AS IS" BASIS,         
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.    
// See the License for the specific language governing permissions and         
// limitations under the License.                                              

/***********************************************************************************************************************************
* This file is generated from BK7256_ADDR Mapping_20211224_format_change_highlight_20220113_update.xlsm automatically                                
* Modify it manually is not recommended                                       
* CHIP ID:BK7256,GENARATE TIME:2022-01-17 15:35:03                                                 
************************************************************************************************************************************/

#pragma once                 
                            
#ifdef __cplusplus          
extern "C" {              
#endif                      
#include "aud_cap.h"       

typedef volatile struct {

    /* REG_0x00 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  samp_rate_adc                  : 2;  //0x0[1:0],ADC采样率配置 0：8K  1：16K  2：44.1K  3：48K,0,RW
           volatile uint32_t  dac_enable                     : 1;  //0x0[2],DAC使能  1：使能,0,RW
           volatile uint32_t  adc_enable                     : 1;  //0x0[3],ADC使能  1：使能,0,RW
           volatile uint32_t  dtmf_enable                    : 1;  //0x0[4],DTMF使能 1: 使能,0,RW
           volatile uint32_t  line_enable                    : 1;  //0x0[5],LINE IN使能  1：使能,0,RW
           volatile uint32_t  samp_rate_dac                  : 2;  //0x0[7:6],DAC采样率配置 0：8K  1：16K  2：44.1K  3：48K,0,RW
           volatile uint32_t  reserved                       :24;  //0x0[31:8],reserved,0,R
        }; 
        uint32_t v; 
    }audio_config; 

    /* REG_0x01 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tone_pattern                   : 1;  //0x1[0],1：Tone1(Active_Time) + Tone2(Pause_Time)              0: DTMF(Active_Time) + Zeros(Pause_Time),0,RW
           volatile uint32_t  tone_mode                      : 1;  //0x1[1],1：连续模式， 0：单次模式,0,RW
           volatile uint32_t  tone_pause_time                : 4;  //0x1[5:2],DTMF的间歇时间  N*10 ms,0,RW
           volatile uint32_t  tone_active_time               : 4;  //0x1[9:6],DTMF的工作时间  N*10 ms,0,RW
           volatile uint32_t  reserved                       :22;  //0x1[31:10],reserved,0,R
        }; 
        uint32_t v; 
    }dtmf_config0; 

    /* REG_0x02 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tone1_step                     :16;  //0x2[15:0],Tone1的频率设置  Step = F(KHz) * 8191 ,0,RW
           volatile uint32_t  tone1_attu                     : 4;  //0x2[19:16],Tone1的衰减设置  0 ：-1 ：-15 dB ,0,RW
           volatile uint32_t  tone1_enable                   : 1;  //0x2[20],Tone1的使能设置,0,RW
           volatile uint32_t  reserved                       :11;  //0x2[31:21],reserved,0,R
        }; 
        uint32_t v; 
    }dtmf_config1; 

    /* REG_0x03 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tone2_step                     :16;  //0x3[15:0],Tone2的频率设置  Step = F(KHz) * 8191 ,0,RW
           volatile uint32_t  tone2_attu                     : 4;  //0x3[19:16],Tone2的衰减设置  0 ：-1 ：-15 dB ,0,RW
           volatile uint32_t  tone2_enable                   : 1;  //0x3[20],Tone2的使能设置,0,RW
           volatile uint32_t  reserved                       :11;  //0x3[31:21],reserved,0,R
        }; 
        uint32_t v; 
    }dtmf_config2; 

    /* REG_0x04 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  adc_hpf2_coef_b2               :16;  //0x4[15:0],ADC HPF2的系数 B2 ,0,RW
           volatile uint32_t  adc_hpf2_bypass                : 1;  //0x4[16],ADC HPF2禁能位，1：绕开HPF2,0,RW
           volatile uint32_t  adc_hpf1_bypass                : 1;  //0x4[17],ADC HPF1禁能位，1：绕开HPF1,0,RW
           volatile uint32_t  adc_set_gain                   : 6;  //0x4[23:18],ADC 设置的增益,0,RW
           volatile uint32_t  adc_sampe_edge                 : 1;  //0x4[24],ADC数据采样的时钟边沿选择 1：下降沿，0：上升沿,0,RW
           volatile uint32_t  reserved                       : 7;  //0x4[31:25],reserved,0,R
        }; 
        uint32_t v; 
    }adc_config0; 

    /* REG_0x05 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  adc_hpf2_coef_b0               :16;  //0x5[15: 0],ADC HPF2的系数 B2 ,0,RW
           volatile uint32_t  adc_hpf2_coef_b1               :16;  //0x5[31:16],ADC HPF2的系数 B1 ,0,RW
        }; 
        uint32_t v; 
    }adc_config1; 

    /* REG_0x06 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  adc_hpf2_coef_a0               :16;  //0x6[15: 0],ADC HPF2的系数 A0 ,0,RW
           volatile uint32_t  adc_hpf2_coef_a1               :16;  //0x6[31:16],ADC HPF2的系数 A1 ,0,RW
        }; 
        uint32_t v; 
    }adc_config2; 

    /* REG_0x07 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  dac_hpf2_coef_b2               :16;  //0x7[15:0],DAC HPF2的系数 B2 ,0,RW
           volatile uint32_t  dac_hpf2_bypass                : 1;  //0x7[16],DAC HPF2禁能位，1：绕开HPF2,0,RW
           volatile uint32_t  dac_hpf1_bypass                : 1;  //0x7[17],DAC HPF1禁能位，1：绕开HPF1 ,0,RW
           volatile uint32_t  dac_set_gain                   : 6;  //0x7[23:18],DAC 设置的增益,0,RW
           volatile uint32_t  dac_clk_invert                 : 1;  //0x7[24],DAC 输出时钟边沿选择 0：下降沿，1：上升沿,0,RW
           volatile uint32_t  reserved                       : 7;  //0x7[31:25],reserved,0,R
        }; 
        uint32_t v; 
    }dac_config0; 

