openharmony/device_soc_beken/bk7235/liteos_m/bk_sdk_armino/middleware/soc/bk7235/soc/aud_struct.h
    /* REG_0x08 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  dac_hpf2_coef_b0               :16;  //0x8[15: 0],DAC HPF2的系数 B0 ,0,RW
           volatile uint32_t  dac_hpf2_coef_b1               :16;  //0x8[31:16],DAC HPF2的系数 B1 ,0,RW
        }; 
        uint32_t v; 
    }dac_config1; 

    /* REG_0x09 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  dac_hpf2_coef_a1               :16;  //0x9[15: 0],DAC HPF2的系数 A1 ,0,RW
           volatile uint32_t  dac_hpf2_coef_a2               :16;  //0x9[31:16],DAC HPF2的系数 A2 ,0,RW
        }; 
        uint32_t v; 
    }dac_config2; 

    /* REG_0x0a */
    union 
    { 
        struct 
        { 
           volatile uint32_t  dacr_rd_threshold              : 5;  //0xa[4:0],DAC右声道读FIFO时，数目低于该门限，发出中断请求,0,RW
           volatile uint32_t  dacl_rd_threshold              : 5;  //0xa[9:5],DAC左声道读FIFO时，数目低于该门限，发出中断请求,0,RW
           volatile uint32_t  dtmf_wr_threshold              : 5;  //0xa[14:10],DTMF自动写FIFO时，数目高于该门限，发出中断请求,0,RW
           volatile uint32_t  adcl_wr_threshold              : 5;  //0xa[19:15],ADC自动写FIFO时，数目高于该门限，发出中断请求,0,RW
           volatile uint32_t  dacr_int_en                    : 1;  //0xa[20],DAC右声道中断请求使能位,0,RW
           volatile uint32_t  dacl_int_en                    : 1;  //0xa[21],DAC左声道中断请求使能位,0,RW
           volatile uint32_t  dtmf_int_en                    : 1;  //0xa[22],DTMF中断请求使能位,0,RW
           volatile uint32_t  adcl_int_en                    : 1;  //0xa[23],ADC中断请求使能位,0,RW
           volatile uint32_t  loop_ton2dac                   : 1;  //0xa[24],DTMF到DAC环回测试使能位,0,RW
           volatile uint32_t  loop_adc2dac                   : 1;  //0xa[25],ADC到DAC环回测试使能位,0,RW
           volatile uint32_t  reserved                       : 6;  //0xa[31:26],reserved,0,R
        }; 
        uint32_t v; 
    }fifo_config; 

    /* REG_0x0b */
    union 
    { 
        struct 
        { 
           volatile uint32_t  agc_noise_thrd                 :10;  //0xb[ 9: 0],noise gating 执行时刻的门限，noise gating要在audio值比较小的时候执行,0,RW
           volatile uint32_t  agc_noise_high                 :10;  //0xb[19:10],对应MIC_RSSI低10 bit,0,RW
           volatile uint32_t  agc_noise_low                  :10;  //0xb[29:20],对应MIC_RSSI低10 bit，比如MIC_RSSI[15:10]任何一位为1，都说明信号电平超过NOISE_LOW,0,RW
           volatile uint32_t  agc_step                       : 2;  //0xb[31:30],没有用,0,RW
        }; 
        uint32_t v; 
    }agc_config0; 

    /* REG_0x0c */
    union 
    { 
        struct 
        { 
           volatile uint32_t  agc_noise_min                  : 7;  //0xc[6:0],{GAIN2[2:0] GAIN1[3:0]} when signal level below NOISE_LOW, when noise gating is enabled,0,RW
           volatile uint32_t  agc_noise_tout                 : 3;  //0xc[9:7],1: 4 (~0.5 ms), 2: 8, 3: 16, 4: 32, 5: 64, 6: 128, 7: 256 (~32 ms),0,RW
           volatile uint32_t  agc_high_dur                   : 3;  //0xc[12:10],0: 0 (0 ms，一旦发生MIC_RSSI超过NOISE_HIGH，立刻触发Noise gating，离开noise状态); 1: 8 (~1 ms), 2: 16, 3: 32, 4: 64, 5: 128, 6: 256, 7: 256 (~32 ms),0,RW
           volatile uint32_t  agc_low_dur                    : 3;  //0xc[15:13],0: 0 (0 ms，一旦发生MIC_RSSI小于NOISE_LOW，立刻触发noise gating); 1: 8 (~1 ms), 2: 16, 3: 32, 4: 64, 5: 128, 6: 256, 7: 256 (~32 ms),0,RW
           volatile uint32_t  agc_min                        : 7;  //0xc[22:16],Minimum value of {GAIN2[2:0] GAIN1[3:0]},0,RW
           volatile uint32_t  agc_max                        : 7;  //0xc[29:23],Maximum value of {GAIN2[2:0] GAIN1[3:0]}; Also the  default gain setting when AGC is disabled,0,RW
           volatile uint32_t  agc_ng_method                  : 1;  //0xc[30],0: 直接mute或者demute (default); 1: 逐渐降低增益或者增加增益,0,RW
           volatile uint32_t  agc_ng_enable                  : 1;  //0xc[31],使能 noise gating,0,RW
        }; 
        uint32_t v; 
    }agc_config1; 

    /* REG_0x0d */
    union 
    { 
        struct 
        { 
           volatile uint32_t  agc_decay_time                 : 3;  //0xd[2:0],0: 128 (~2.7 ms), 1: 256, 2: 512, 3: 1024, 4:2048, 5: 4096, 6: 8192, 7: 16384 (~340 ms),0,RW
           volatile uint32_t  agc_attack_time                : 3;  //0xd[5:3],0: 8 (~0.1667ms), 1: 16, 2: 32, 3: 64, 4: 128, 5: 256, 6: 512, 7: 1024 (~21 ms),0,RW
           volatile uint32_t  agc_high_thrd                  : 5;  //0xd[10:6],对应到MIC_RSSI的最高5位,0,RW
           volatile uint32_t  agc_low_thrd                   : 5;  //0xd[15:11],对应到MIC_RSSI的最高5位,0,RW
           volatile uint32_t  agc_iir_coef                   : 3;  //0xd[18:16],IIR系数选择 0:1/32 1:1/64 2:1/128 3:1/256 4:1/512 5:1/1024 6:1/2048 7:1/4096,0,RW
           volatile uint32_t  agc_enable                     : 1;  //0xd[19],AGC使能位,0,RW
           volatile uint32_t  manual_pga_value               : 7;  //0xd[26:20],手动PGA的值,0,RW
           volatile uint32_t  manual_pga                     : 1;  //0xd[27],手动PGA模式,0,RW
           volatile uint32_t  reserved                       : 4;  //0xd[31:28],reserved,0,R
        }; 
        uint32_t v; 
    }agc_config2; 

    /* REG_0x0e */
    union 
    { 
        struct 
        { 
           volatile uint32_t  dacr_near_full                 : 1;  //0xe[0],DAC右声道FIFO快要满  （默认大于3/4的容量）,0,R
           volatile uint32_t  dacl_near_full                 : 1;  //0xe[1],DAC左声道FIFO快要满,0,R
           volatile uint32_t  adcl_near_full                 : 1;  //0xe[2],ADC左声道FIFO快要满,0,R
           volatile uint32_t  dtmf_near_full                 : 1;  //0xe[3],DTMF的FIFO快要满,0,R
           volatile uint32_t  dacr_near_empty                : 1;  //0xe[4],DAC右声道FIFO快要空  （默认小于1/4的容量）,0,R
           volatile uint32_t  dacl_near_empty                : 1;  //0xe[5],DAC左声道FIFO快要空,0,R
           volatile uint32_t  adcl_near_empty                : 1;  //0xe[6],ADC左声道FIFO快要空,0,R
           volatile uint32_t  dtmf_near_empty                : 1;  //0xe[7],DTMF的FIFO快要空,0,R
           volatile uint32_t  dacr_fifo_full                 : 1;  //0xe[8],DAC右声道FIFO已满    (达到FIFO容量的最大值）,0,R
           volatile uint32_t  dacl_fifo_full                 : 1;  //0xe[9],DAC左声道FIFO已满,0,R
           volatile uint32_t  adcl_fifo_full                 : 1;  //0xe[10],ADC左声道FIFO已满,0,R
           volatile uint32_t  dtmf_fifo_full                 : 1;  //0xe[11],DTMF的FIFO已满,0,R
           volatile uint32_t  dacr_fifo_empty                : 1;  //0xe[12],DAC右声道FIFO已空   (达到FIFO容量的最小值）,0,R
           volatile uint32_t  dacl_fifo_empty                : 1;  //0xe[13],DAC左声道FIFO已空,0,R
           volatile uint32_t  adcl_fifo_empty                : 1;  //0xe[14],ADC左声道FIFO已空,0,R
           volatile uint32_t  dtmf_fifo_empty                : 1;  //0xe[15],DTMF的FIFO已空,0,R
           volatile uint32_t  dacr_int_flag                  : 1;  //0xe[16],DAC右声道中断标志,0,R
           volatile uint32_t  dacl_int_flag                  : 1;  //0xe[17],DAC左声道中断标志,0,R
           volatile uint32_t  adcl_int_flag                  : 1;  //0xe[18],ADC左声道中断标志,0,R
           volatile uint32_t  dtmf_int_flag                  : 1;  //0xe[19],DTMF的中断标志,0,R
           volatile uint32_t  reserved                       :12;  //0xe[31:20],reserved,0,R
        }; 
        uint32_t v; 
    }fifo_status; 

    /* REG_0x0f */
    union 
    { 
        struct 
        { 
           volatile uint32_t  rssi                           : 8;  //0xf[7:0],Absolutely microphone signal power in dB unit; Read only,0,R
           volatile uint32_t  mic_pga                        : 8;  //0xf[15:8],{1'b0, GAIN2[2:0] GAIN1[3:0]} (Read only),0,R
           volatile uint32_t  mic_rssi                       :16;  //0xf[31:16],Microphone level; MIC_RSSI[15:0]; Read only,0,R
        }; 
        uint32_t v; 
    }agc_status; 

    /* REG_0x10 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  dtmf_port                      :16;  //0x10[15:0],DTMF的FIFO读出地址,0,R
           volatile uint32_t  reserved                       :16;  //0x10[31:16],reserved,0,R
        }; 
        uint32_t v; 
    }dtmf_fport; 

    /* REG_0x11 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  adc_port                       :16;  //0x11[15:0],ADC的FIFO读出地址,0,R
           volatile uint32_t  reserved                       :16;  //0x11[31:16],reserved,0,R
        }; 
        uint32_t v; 
    }adc_fport; 

